# Ultimate Objective
掌握Spring全家桶，掌握Java的整体知识框架（封装、继承、多态、正则表达式、集合、IO流、多线程等内容），掌握JavaScript+HTML+CSS等前端技术、复习巩固数据结构和数据库

## Prerequisites for implementatio
在实施计划前，先再次回顾复习一下假期间学习的Git内容，能够熟练运用Git中的基本语法指令进行基础操作。

## Step One Arrangement 
在此期间首先主要复习巩固***数据结构***和***数据库***这两部分内容，其他内容在此期间次要学习掌握，数据库和数据结构学习里面的编程思想，数据结构主要学习存储结构和逻辑结构。存储结构是数据在计算机中实际的存在形态，逻辑结构是我们程序人员需要的数据形态。数据结构就是学习如何抽像信息、如何封装数据、如何处理数据元素之间的关系，掌握里面的***哈夫曼树和哈夫曼算法，栈、队列和数组，以及排序等内容***；数据库可视存储文件的一个处所，用户可以对文件中的数据进行新增、查询、更新、删除等操作，是以一定方式储存在一起、能与多个用户共享、具有尽可能小的冗余度、与应用程序彼此独立的数据集合。学习数据库时，一定要掌握好最重要的***SQL语言的功能与用法，配合MySQL进行练习掌握***，能熟练运用MySQL。

* 注：数据库和数据结构两部分内容以配合书籍为主，看视频讲解为辅，整合学习。

***Aim:*** 能够熟练运用MySQL进行基础简单的操作，理解并能运用数据结构的编程思想，为后面的JAVA学习奠定一定的基础。

## Step Two Arrangement
在此期间主要着手学习复习巩固***java***，其他内容在此期间次要学习掌握，java一定要掌握它的基础内容部分，巩固复习假期里面学习的内容，多进行练习，多敲代码，以IntelliJ IDEA为基本平台使用，逐渐放弃eclipse的使用，***必须掌握类与对象、封装、继承、多态、集合、正则表达式、多线程和IO流等重点内容***，这期间配合网上慕课视频、bilibili网站视频教程还有java编程书籍进行系统学习掌握，掌握他们的使用方式，并将平时的学习心得还有练习的代码等提交到GitHub账户，在完全掌握java的基础的前提下，再进行java的深入学习，学习java的高级应用。

***Aim:*** 首先要理解并掌握java的基础知识部分，并能够熟悉运用编写小程序，然后再学习掌握java的高级应用部分，争取能够自行处理一些基础工作，加油！

## Step Three Arrangement
在该阶段主要系统学习前端操作，并安排时间复习巩固上面学习的内容，然后首先掌握HTML和CSS两部分内容，以观看视频教程为主，在DW或者IntelliJ IDEA平台上面进行demo练习，在能熟练运用该部分内容的前提下，能够独立运用HTML和CSS编写出静态网页后，进行javaScript的学习，期间以视频教学为主进行学习，先了解JavaScript的概念和使用目的，然后再学习它的基础知识：***基本语法、结构语句、事件、BOM浏览器对象模型、BOM浏览器对象模型等内容***，在完全掌握并理解的情况下，能够独立编写代码的前提下，在学习JS的高级内容。

***Aim：*** 首先掌握HTML和CSS内容，明白他们的使用方式和实现原理，可以自己编写简单的静态网页，然后再运用JS等内容配合编写出简单的动态网页。

## Step Four Arrangement
在完成以上阶段的学习后，再重点进行Spring的学习，在学习Spring前先搞清楚他是什么？是干什么的，有什么作用？然后再按部就班进行学习，Spring的核心是：控制反转(IoC)和面向切面编程(AOP)，所以在学习的时候要格外注意这部分内容的学习及巩固，在Spring的学习中先以Spring mvc、Mybatis和Spring boot这三块内容进行，学习的先后顺序按照该顺序进行：***Spring mvc--> Mybatis --> Spring boot***，以学习网站中的学习视频为主要路线，再浏览其他码农的学习经验文章进行学习，如果时间精力运行的前提下，再学习***redis、dubbo***这两部分内容。

***Aim：*** 理解Spring的概念，明白它是做什么的，使用它的目的是什么，理解并掌握Spring核心内容【控制反转(IoC)和面向切面编程(AOP)】的基础部分，并能够配合java进行基础的操作。

## Step Five Arrangement
可以独立完成一个简易程序或者简易网站，能够运行简单的需求和功能

### Come On！ 
